/*===================================
-정렬(sort)알고리즘
================================*/

/*
정렬 : 데이터를 특정한 규칙(기준)에 맞게 순서대로 나열(오름차순,내림차순)

정렬의 목적 : 보기좋으라고
			데이터 처리과정의 편의성이나 가독성을 높이기 위함

컴퓨터 리소스의 부하가 심한 작업이 정렬이다. 


정렬의 종류
 
 
 
 버블정렬

 실행 예)
 source Data = 52 42 12 62 60

 이 데이터를 12 42 52 60 62

 계속하려면 아무키나 누르세요..

*/

public class Test108
{
	public static void main(String[] args)
	{

		int[] a = {52,42,12,62,60};

		
		for(int i=1;i<a.length;i++)      //i -> 1    2   3  4 i의 역할은 오른쪽 끝을 고정하는역할
		{
			for(int j=0;j<a.length-i;j++)//j -> 0123 012 01 0
			{
				if(a[j]>a[j+1])
				{
				a[j] = a[j] ^ a[j+1];
				a[j+1] = a[j+1] ^ a[j];
				a[j] = a[j] ^ a[j+1];
						
				}
			for(int n : a)
			System.out.print(n + " ");
			System.out.println();
			}
			System.out.println("*");
			
		}

/*

		for(int i=0;i<a.length-i-1;i++)       0            1
		{
			for(int j=0;j<a.length-1-i;j++) 01,12,23,34,
			{
				if(a[j]>a[j+1])
				{
				a[j] = a[j] ^ a[j+1];
				a[j+1] = a[j+1] ^ a[j];
				a[j] = a[j] ^ a[j+1];
						
				}
			for(int n : a)
			System.out.print(n + " ");
			System.out.println();
			}
			System.out.println("*");
			
	
		}
*/
		/*
		52,42,12,62,60
		== --

		42,52,12,62,60
		== --

		42,52,12,62,60
		   == --

		42,12,52,62,60
		   == --

		42,12,52,62,60
			  == --
			 
		42,12,52,62,60
			     == --
		
		42,12,52,60,62
			     == --
     -------------------------
		12,42,52,60,62
		== --
		12,42,52,60,62
	       == --	
		12,42,52,60,62
		      == --		
      ----------------------- 버블 정렬은 오른쪽이 고정	 


		*/


	}
}
